[
    {
        "slytherin": "Slytherin House values ambition, leadership, self-preservation, cunning and resourcefulness and was founded by Salazar Slytherin. Its emblematic animal is the serpent, and its colours are emerald green and silver. Professor Horace Slughorn was the Head of Slytherin during the 1997–1998 school year, replacing Severus Snape, who as well, replaced Slughorn as Potions Professor when he retired for the first time several years prior. Slytherin had produced the most Death Eaters and Dark Wizards, including Tom Riddle, Bellatrix Lestrange and Lucius Malfoy, for example. But that does not mean that other Houses haven’t produced any; Peter Pettigrew was a Gryffindor, and Quirinus Quirrell was a Ravenclaw."
    },
    {
        "ravenclaw": "Ravenclaw values intelligence, knowledge, curiosity, creativity and wit. Its emblematic animal is the eagle, and its colours are blue and bronze. The Ravenclaw Head of House in the 1990s was Filius Flitwick. The ghost of Ravenclaw is the Grey Lady, who was the daughter of Rowena Ravenclaw, the House's founder. Ravenclaw corresponds to the element of air. The Ravenclaw common room and dormitories are located in a tower on the west side of the castle. Ravenclaw students must answer a riddle as opposed to giving a password to enter their dormitories. This riddle, however, can be answered by non-Ravenclaws. Famous Ravenclaws include Luna Lovegood, Gilderoy Lockhart, Ignatia Wildsmith (inventor of Floo powder), and Garrick Ollivander."
    },
    {
        "hufflepuff": "Hufflepuff values hard work, dedication, patience, loyalty, and fair play. Its emblematic animal is the badger, and yellow and black are its colours. Pomona Sprout was the Head of Hufflepuff during 1991-1998, Sprout left the post of Head of Hufflepuff and Herbology Professor sometime before 2017 and her successor for the position of Head of Hufflepuff is currently unknown. The Fat Friar is its ghost. The founder of the House was Helga Hufflepuff. Hufflepuff corresponds to the element of earth. The Hufflepuff dormitories and common room are located somewhere in the basement, near the castle's kitchens. It can be accessed by tapping the barrel two from the bottom, middle of the second row in the rhythm of Helga Hufflepuff and is described as being a cosy and welcoming place with yellow hangings, fat armchairs, and underground tunnels that lead to the dormitories, which have perfectly round doors, similar to barrel tops. Famous Hufflepuffs include Hengist of Woodcroft (founder of Hogsmeade), Newt Scamander (author of Fantastic Beasts and Where to Find Them), and Artemisia Lufkin (first female minister for magic)."
       
    },
    {
        "gryffindor": "Gryffindor values bravery, daring, nerve, and chivalry. Its emblematic animal is the lion, and its colours are scarlet and gold. Minerva McGonagall was the most recent Head of Gryffindor. Sir Nicholas de Mimsy-Porpington, also known as Nearly Headless Nick, was the House Ghost. The founder of the House was Godric Gryffindor. Gryffindor corresponds to the element of Fire. The common room was located in one of the highest towers at Hogwarts, the entrance was situated on the seventh floor in the east wing of the castle and is guarded by a portrait of The Fat Lady. She permits entrance if given the correct password, which is changed numerous times throughout the school year. Famous Gryffindors include Albus Dumbledore, Harry Potter, and Minerva McGonagall."
        
    },
    {
        "wand": "A wand is a quasi-sentient magical instrument through which a witch or wizard channels her or his magical powers to centralise the effects for more complex results. Most spells are cast with the aid of wands, but spells can be cast without the use of wands. Wandless magic is, however, very difficult and requires much concentration and incredible skill; advanced wizards and some magical creatures such as house elves are known to perform such magic. Wands are manufactured and sold by wandmakers, the most famous of these in Great Britain being Ollivander, and in Eastern Europe Gregorovitch. Each wand consists of a specific type of wood that surrounds a core of magical substance. Although the wand cores may come from the same creature, or the wood may come from the same tree, no two existing wands are exactly alike. The study of the history and the magical properties of wands is called wandlore."
    },
    {
        "whistory": "Magic with a wand is usually performed with an incantation, but more experienced wizards can cast nonverbal spells, which conceal the spell until cast and may thereby prevent an opponent from adequately protecting him- or herself in time. Wands are referred to as quasi-sentient because their being imbued with a great deal of magic makes them as animate as an inanimate object can be. Every single wand is unique and will depend for its character on the particular tree and magical creature from which it derives its materials. Moreover, each wand, from the moment it finds its ideal owner, will begin to learn from and teach its human partner."
    },
    {
        "patronus": "The Patronus Charm (Expecto Patronum) was the most famous and one of the most powerful defensive charms known to wizardkind. It was an immensely complicated and an extremely difficult spell, that evoked a partially-tangible positive energy force known as a Patronus (pl. Patronuses) or spirit guardian. It was the primary protection against Dementors and Lethifolds, against which there were no other defence. There are two types of Patronuses: corporeal which means a Patronus with a particular shape and form and incorporeal Patronus. Incorporeal Patronuses have no particular shape and do not protect against dementors the way corporeal Patronuses do. However, some wizards like Remus Lupin choose to cast incorporeal Patronuses to hide their identity."
    },
    {
        "pathistory": "It is evident from old woodcuts and scrolls that the Patronus Charm has been used since ancient times. Therefore, it is unknown who created it, or when it was first invented.[6] The charm also has a long association with those fighting for lofty or noble causes (those able to produce corporeal Patronuses were often elected to high office within the Wizengamot and Ministry of Magic).[4]"
    },
    {
        "patcast": "To successfully cast the spell, one begins by mustering the happiest memory they can think of (the happier the memory, the better the charm will work). Alternatively, one could imagine a scenario that would make for a very happy memory, as Harry did for his D.A.D.A. O.W.L. The next step is to begin drawing circles with their wand so as to increase the power of their spell. They must then say the incantation, Expecto Patronum; the Patronus will come from the tip of the wand and can be directed towards a target by pointing one's wand at said target. It is possible to disguise the form one's Patronus takes, which was done both by Severus Snape to hide his love for Lily Evans, and by Remus Lupin, who felt it would give away his condition. Also, some witches and wizards may be unable to produce a Patronus at all until they have undergone some kind of psychic shock. Although it is extremely hard to fully conjure a Patronus, in an Alternate reality fourth years in Defence Against the Dark Arts class were tasked with casting this charm."
    }
    
    
]